bench/rest/rest-run1.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: bench/patient-create.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m30s max duration (incl. graceful stop):
              * patients: 10 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 10/10 VUs, 76 complete and 0 interrupted iterations
patients   [   2% ] 10 VUs  0m01.0s/1m0s

running (0m02.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
patients   [   3% ] 10 VUs  0m02.0s/1m0s

running (0m03.0s), 10/10 VUs, 289 complete and 0 interrupted iterations
patients   [   5% ] 10 VUs  0m03.0s/1m0s

running (0m04.0s), 10/10 VUs, 365 complete and 0 interrupted iterations
patients   [   7% ] 10 VUs  0m04.0s/1m0s

running (0m05.0s), 10/10 VUs, 505 complete and 0 interrupted iterations
patients   [   8% ] 10 VUs  0m05.0s/1m0s

running (0m06.0s), 10/10 VUs, 683 complete and 0 interrupted iterations
patients   [  10% ] 10 VUs  0m06.0s/1m0s

running (0m07.0s), 10/10 VUs, 781 complete and 0 interrupted iterations
patients   [  12% ] 10 VUs  0m07.0s/1m0s

running (0m08.0s), 10/10 VUs, 956 complete and 0 interrupted iterations
patients   [  13% ] 10 VUs  0m08.0s/1m0s

running (0m09.0s), 10/10 VUs, 1144 complete and 0 interrupted iterations
patients   [  15% ] 10 VUs  0m09.0s/1m0s

running (0m10.0s), 10/10 VUs, 1399 complete and 0 interrupted iterations
patients   [  17% ] 10 VUs  0m10.0s/1m0s

running (0m11.0s), 10/10 VUs, 1529 complete and 0 interrupted iterations
patients   [  18% ] 10 VUs  0m11.0s/1m0s

running (0m12.0s), 10/10 VUs, 1625 complete and 0 interrupted iterations
patients   [  20% ] 10 VUs  0m12.0s/1m0s

running (0m13.0s), 10/10 VUs, 1775 complete and 0 interrupted iterations
patients   [  22% ] 10 VUs  0m13.0s/1m0s

running (0m14.0s), 10/10 VUs, 1842 complete and 0 interrupted iterations
patients   [  23% ] 10 VUs  0m14.0s/1m0s

running (0m15.0s), 10/10 VUs, 1896 complete and 0 interrupted iterations
patients   [  25% ] 10 VUs  0m15.0s/1m0s

running (0m16.0s), 10/10 VUs, 2000 complete and 0 interrupted iterations
patients   [  27% ] 10 VUs  0m16.0s/1m0s

running (0m17.0s), 10/10 VUs, 2173 complete and 0 interrupted iterations
patients   [  28% ] 10 VUs  0m17.0s/1m0s

running (0m18.0s), 10/10 VUs, 2310 complete and 0 interrupted iterations
patients   [  30% ] 10 VUs  0m18.0s/1m0s

running (0m19.0s), 10/10 VUs, 2395 complete and 0 interrupted iterations
patients   [  32% ] 10 VUs  0m19.0s/1m0s

running (0m20.0s), 10/10 VUs, 2545 complete and 0 interrupted iterations
patients   [  33% ] 10 VUs  0m20.0s/1m0s

running (0m21.0s), 10/10 VUs, 2624 complete and 0 interrupted iterations
patients   [  35% ] 10 VUs  0m21.0s/1m0s

running (0m22.0s), 10/10 VUs, 2704 complete and 0 interrupted iterations
patients   [  37% ] 10 VUs  0m22.0s/1m0s

running (0m23.0s), 10/10 VUs, 2760 complete and 0 interrupted iterations
patients   [  38% ] 10 VUs  0m23.0s/1m0s

running (0m24.0s), 10/10 VUs, 2876 complete and 0 interrupted iterations
patients   [  40% ] 10 VUs  0m24.0s/1m0s

running (0m25.0s), 10/10 VUs, 3025 complete and 0 interrupted iterations
patients   [  42% ] 10 VUs  0m25.0s/1m0s

running (0m26.0s), 10/10 VUs, 3092 complete and 0 interrupted iterations
patients   [  43% ] 10 VUs  0m26.0s/1m0s

running (0m27.0s), 10/10 VUs, 3173 complete and 0 interrupted iterations
patients   [  45% ] 10 VUs  0m27.0s/1m0s

running (0m28.0s), 10/10 VUs, 3373 complete and 0 interrupted iterations
patients   [  47% ] 10 VUs  0m28.0s/1m0s

running (0m29.0s), 10/10 VUs, 3534 complete and 0 interrupted iterations
patients   [  48% ] 10 VUs  0m29.0s/1m0s

running (0m30.0s), 10/10 VUs, 3691 complete and 0 interrupted iterations
patients   [  50% ] 10 VUs  0m30.0s/1m0s

running (0m31.0s), 10/10 VUs, 3817 complete and 0 interrupted iterations
patients   [  52% ] 10 VUs  0m31.0s/1m0s

running (0m32.0s), 10/10 VUs, 4017 complete and 0 interrupted iterations
patients   [  53% ] 10 VUs  0m32.0s/1m0s

running (0m33.0s), 10/10 VUs, 4262 complete and 0 interrupted iterations
patients   [  55% ] 10 VUs  0m33.0s/1m0s

running (0m34.0s), 10/10 VUs, 4493 complete and 0 interrupted iterations
patients   [  57% ] 10 VUs  0m34.0s/1m0s

running (0m35.0s), 10/10 VUs, 4753 complete and 0 interrupted iterations
patients   [  58% ] 10 VUs  0m35.0s/1m0s

running (0m36.0s), 10/10 VUs, 4849 complete and 0 interrupted iterations
patients   [  60% ] 10 VUs  0m36.0s/1m0s

running (0m37.0s), 10/10 VUs, 4934 complete and 0 interrupted iterations
patients   [  62% ] 10 VUs  0m37.0s/1m0s

running (0m38.0s), 10/10 VUs, 5026 complete and 0 interrupted iterations
patients   [  63% ] 10 VUs  0m38.0s/1m0s

running (0m39.0s), 10/10 VUs, 5047 complete and 0 interrupted iterations
patients   [  65% ] 10 VUs  0m39.0s/1m0s

running (0m40.0s), 10/10 VUs, 5070 complete and 0 interrupted iterations
patients   [  67% ] 10 VUs  0m40.0s/1m0s

running (0m41.0s), 10/10 VUs, 5156 complete and 0 interrupted iterations
patients   [  68% ] 10 VUs  0m41.0s/1m0s

running (0m42.0s), 10/10 VUs, 5339 complete and 0 interrupted iterations
patients   [  70% ] 10 VUs  0m42.0s/1m0s

running (0m43.0s), 10/10 VUs, 5499 complete and 0 interrupted iterations
patients   [  72% ] 10 VUs  0m43.0s/1m0s

running (0m44.0s), 10/10 VUs, 5722 complete and 0 interrupted iterations
patients   [  73% ] 10 VUs  0m44.0s/1m0s

running (0m45.0s), 10/10 VUs, 5870 complete and 0 interrupted iterations
patients   [  75% ] 10 VUs  0m45.0s/1m0s

running (0m46.0s), 10/10 VUs, 5996 complete and 0 interrupted iterations
patients   [  77% ] 10 VUs  0m46.0s/1m0s

running (0m47.0s), 10/10 VUs, 6160 complete and 0 interrupted iterations
patients   [  78% ] 10 VUs  0m47.0s/1m0s

running (0m48.0s), 10/10 VUs, 6292 complete and 0 interrupted iterations
patients   [  80% ] 10 VUs  0m48.0s/1m0s

running (0m49.0s), 10/10 VUs, 6416 complete and 0 interrupted iterations
patients   [  82% ] 10 VUs  0m49.0s/1m0s

running (0m50.0s), 10/10 VUs, 6572 complete and 0 interrupted iterations
patients   [  83% ] 10 VUs  0m50.0s/1m0s

running (0m51.0s), 10/10 VUs, 6759 complete and 0 interrupted iterations
patients   [  85% ] 10 VUs  0m51.0s/1m0s

running (0m52.0s), 10/10 VUs, 6892 complete and 0 interrupted iterations
patients   [  87% ] 10 VUs  0m52.0s/1m0s

running (0m53.0s), 10/10 VUs, 7026 complete and 0 interrupted iterations
patients   [  88% ] 10 VUs  0m53.0s/1m0s

running (0m54.0s), 10/10 VUs, 7127 complete and 0 interrupted iterations
patients   [  90% ] 10 VUs  0m54.0s/1m0s

running (0m55.0s), 10/10 VUs, 7177 complete and 0 interrupted iterations
patients   [  92% ] 10 VUs  0m55.0s/1m0s

running (0m56.0s), 10/10 VUs, 7363 complete and 0 interrupted iterations
patients   [  93% ] 10 VUs  0m56.0s/1m0s

running (0m57.0s), 10/10 VUs, 7540 complete and 0 interrupted iterations
patients   [  95% ] 10 VUs  0m57.0s/1m0s

running (0m58.0s), 10/10 VUs, 7724 complete and 0 interrupted iterations
patients   [  97% ] 10 VUs  0m58.0s/1m0s

running (0m59.0s), 10/10 VUs, 7864 complete and 0 interrupted iterations
patients   [  98% ] 10 VUs  0m59.0s/1m0s

running (1m00.0s), 10/10 VUs, 7932 complete and 0 interrupted iterations
patients   [ 100% ] 10 VUs  1m00.0s/1m0s


  █ TOTAL RESULTS 

    checks_total.......: 7942    132.212505/s
    checks_succeeded...: 100.00% 7942 out of 7942
    checks_failed......: 0.00%   0 out of 7942

    ✓ created

    HTTP
    http_req_duration..............: avg=75.34ms med=56.4ms  p(90)=132.46ms p(95)=180.04ms p(99)=344.06ms max=1.59s
      { expected_response:true }...: avg=75.34ms med=56.4ms  p(90)=132.46ms p(95)=180.04ms p(99)=344.06ms max=1.59s
    http_req_failed................: 0.00%  0 out of 7942
    http_reqs......................: 7942   132.212505/s

    EXECUTION
    iteration_duration.............: avg=75.6ms  med=56.61ms p(90)=132.76ms p(95)=180.56ms p(99)=351.6ms  max=1.6s 
    iterations.....................: 7942   132.212505/s
    vus............................: 10     min=10        max=10
    vus_max........................: 10     min=10        max=10

    NETWORK
    data_received..................: 2.6 MB 43 kB/s
    data_sent......................: 4.0 MB 67 kB/s



running (1m00.1s), 00/10 VUs, 7942 complete and 0 interrupted iterations
patients ✓ [ 100% ] 10 VUs  1m0s